Конфигурация/Catalogs/Виджеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>Виджеты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
	</Catalog>
</MetaDataObject>

Конфигурация/InformationRegisters/ИспользованиеПочты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>ИспользованиеПочты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИспользоватьЛегкуюПочту</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьВстроеннуюПочту</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаИспользоватьЛегкуюПочту</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаИспользоватьВстроеннуюПочту</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Catalogs/Виджеты/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает массив доступных виджетов текущему пользователю.
//
// Параметры:
//   Массив
//     - СправочникСсылка.Виджеты
//
Функция ДоступныеВиджеты() Экспорт
	
	ПолноправныйПользователь = Пользователи.ЭтоПолноправныйПользователь();
	
	ДоступныеВиджеты = Новый СписокЗначений;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьБизнесПроцессыИЗадачи")
		И (РольДоступна("РаботаСЗадачамиИБизнесПроцессами")
			Или ПолноправныйПользователь) Тогда
		
		ДоступныеВиджеты.Добавить(Справочники.Виджеты.МоиЗадачи);
		
		Если Константы.ДобавлятьРуководителямДоступПодчиненных.Получить()
			И (РольДоступна("РаботаСЗадачамиСотрудниковПодразделения")
				Или ПолноправныйПользователь) Тогда
			
			ДоступныеВиджеты.Добавить(Справочники.Виджеты.ЗадачиОтдела);
		КонецЕсли;
	КонецЕсли;
	
	ДоступныеВиджеты.Добавить(Справочники.Виджеты.МоиДокументы);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСВД")
		И (РольДоступна("РаботаСЭДО") Или ПолноправныйПользователь) Тогда
		
		ДоступныеВиджеты.Добавить(Справочники.Виджеты.СВД);
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьХранилищеФайлов") Тогда
		ДоступныеВиджеты.Добавить(Справочники.Виджеты.МоиФайлы);
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВстроеннуюПочту")
		И (РольДоступна("РаботаСоВстроеннойЭлектроннойПочтой") Или ПолноправныйПользователь)
		И РегистрыСведений.ИспользованиеПочты.ПолучитьИспользованиеВстроеннойПочты() Тогда
		
		ДоступныеВиджеты.Добавить(Справочники.Виджеты.Почта);
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУправлениеМероприятиями")
		И (РольДоступна("РаботаСМероприятиями") Или ПолноправныйПользователь) Тогда
		
		ДоступныеВиджеты.Добавить(Справочники.Виджеты.Мероприятия);
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьРабочийКалендарь") Тогда
		ДоступныеВиджеты.Добавить(Справочники.Виджеты.Календарь);
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьОбсуждения") Тогда
		ДоступныеВиджеты.Добавить(Справочники.Виджеты.Форум);
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьКонтрольОбъектов") Тогда
		ДоступныеВиджеты.Добавить(Справочники.Виджеты.Контроль);
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьЕжедневныеОтчеты") Тогда
		ДоступныеВиджеты.Добавить(Справочники.Виджеты.ЕжедневныеОтчеты);
	КонецЕсли;
	
	ДоступныеВиджеты.Добавить(Справочники.Виджеты.МоиДела);
	
	// Сортировка виджетов по наименованию
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Виджеты.Ссылка
		|ИЗ
		|	Справочник.Виджеты КАК Виджеты
		|ГДЕ
		|	Виджеты.Ссылка В(&Виджеты)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Виджеты.Наименование";
	Запрос.УстановитьПараметр("Виджеты", ДоступныеВиджеты);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

#КонецОбласти

#КонецЕсли
